test_playbook/expects/book_8_multi_plays.puml
@startuml
state "= Play: play 1" as play_1 {
    play_1 : | hosts | localhost |
    play_1 : | gather_facts | False |
    state "== debug" as task_1
    task_1 : Action **debug**
    task_1 : | msg | Hello Play 1 |
}
state "= Play: play 2" as play_2 {
    play_2 : | hosts | all |
    play_2 : | gather_facts | True |
    state "== debug" as task_2
    task_2 : Action **debug**
    task_2 : | msg | Hello Play 2 |
}
state "= Play: Test 1" as play_3 {
    play_3 : | hosts | all |
    state "== debug" as task_3
    task_3 : Action **debug**
    task_3 : | msg | Test 1 |
}
[*] --> task_1
task_1 --> task_2
task_2 --> task_3
task_3 --> [*]
@enduml
